app/views/artists/show.html.erb

<br>
<% @artist.albums.each do |alb| %>
---
SELECT `albums`.* FROM `albums` INNER JOIN `album_by_artists` ON `albums`.`id` = `album_by_artists`.`album_id` WHERE `album_by_artists`.`artist_id` = 1