app/views/songs/search.html.erb

<% end %>
<% if logged_in? && current_user.song_reviews.size > 0 %>
---
SELECT `songs`.`id` FROM `songs` WHERE (artist_id = 6)