app/views/songs/show.html.erb

SELECT `artists`.* FROM `artists` INNER JOIN `song_by_artists` ON `artists`.`id` = `song_by_artists`.`artist_id` WHERE `song_by_artists`.`song_id` = 9
---
By:
<% @song.artists.each do |art| %>

SELECT COUNT(*) FROM `song_reviews` WHERE `song_reviews`.`song_id` = 9
SELECT `song_reviews`.* FROM `song_reviews` WHERE `song_reviews`.`song_id` = 1
---

<% if @song.song_reviews.size > 0  && @song.avg_rating > 0 %>