app/views/albums/show.html.erb

SELECT `artists`.* FROM `artists` INNER JOIN `album_by_artists` ON `artists`.`id` = `album_by_artists`.`artist_id` WHERE `album_by_artists`.`album_id` = 1
---
By:
<% @album.artists.each do |art| %>

SELECT `album_reviews`.* FROM `album_reviews` WHERE `album_reviews`.`album_id` = 17
SELECT COUNT(*) FROM `album_reviews` WHERE `album_reviews`.`album_id` = 17
---

<% if @album.album_reviews.size > 0  && @album.avg_rating > 0 %>

SELECT `tracklists`.* FROM `tracklists` WHERE (album_id = 2 and song_id = 4) ORDER BY `tracklists`.`id` ASC LIMIT 1
---

<% @album.get_tracklist.each do |song| %>

SELECT `album_reviews`.* FROM `album_reviews` WHERE `album_reviews`.`album_id` = 17
---
<h1> Reviews </h1>
<% @album.album_reviews.each do |review| %>