app/controllers/albums_controller.rb

    def show
        @album = Album.find(params[:id])
---
SELECT `albums`.* FROM `albums` WHERE `albums`.`id` = 1 LIMIT 1

    def search
        if params[:search] != nil
            input = params[:search].downcase
            @results = Album.all.where("lower(title) LIKE :search", search: "%"+input+"%")
---
SELECT `albums`.* FROM `albums` WHERE (lower(title) LIKE '%%')