app/controllers/songs_controller.rb

    def show
        @song = Song.find(params[:id])
---
SELECT `songs`.* FROM `songs` WHERE `songs`.`id` = 9 LIMIT 1

    def search
      if params[:search] != nil
        input = params[:search].downcase
        @results = Song.all.where("lower(title) LIKE :search", search: "%"+input+"%")
        var = Artist.all.where("lower(name) LIKE :search", search: "%"+input+"%")
        var2 = []
        var.each do |x|
          var2 = var2 + SongByArtist.all.where("artist_id = :id", id: x.id)
        end
        var2.each do |x|
          @results = @results + Song.all.where("id = :id", id: x.song_id)
---
SELECT `songs`.* FROM `songs` WHERE (lower(title) LIKE '%%')
SELECT `artists`.* FROM `artists` WHERE (lower(name) LIKE '%%')
SELECT `song_by_artists`.* FROM `song_by_artists` WHERE (artist_id = 1)
SELECT `song_by_artists`.* FROM `song_by_artists` WHERE (artist_id = 3)
SELECT `artists`.* FROM `artists` WHERE (lower(title) LIKE '%b%')

    def song_recs
      sql_recs = StoredProcedures.songs_by_users(current_user.id)
      recs = []
      displayed_recs = []
      sql_recs.each do |rec|
        recs << rec['song_id']
      end

      5.times do
          if recs.size > 0
            random = rand(recs.size)
            displayed_recs << Song.where(id: recs[random]).first
---
SELECT `songs`.* FROM `songs` WHERE (artist_id = 6)
SELECT `songs`.* FROM `songs` WHERE (id = 40)
SELECT `songs`.* FROM `songs` WHERE (artist_id = 6) LIMIT 11